data/raw/kv_vram_control/qwen/background_logs/qwen_bgload_c64i1024o512_probeconc4_d2_gmem065_run1_conc64.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72ac4d198fe0>, trust_remote_code=False, seed=0, num_prompts=40, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['role=background_load', 'label=c64i1024o512_probeconc4_d2_gmem065_run1', 'iteration=1'], result_dir='./fixd_kv_pressure_runs_gmem065_main/qwen/background_logs/iterations', result_filename='qwen_bgload_c64i1024o512_probeconc4_d2_gmem065_run1_conc64_iter1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-a8f404d2-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-27 16:29:12 [datasets.py:631] Sampling input_len from [1024, 1024] and output_len from [512, 512]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 40/40 [00:55<00:00,  1.38s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  55.22     
Total input tokens:                      40960     
Total generated tokens:                  20480     
Request throughput (req/s):              0.72      
Output token throughput (tok/s):         370.90    
Peak output token throughput (tok/s):    679.00    
Peak concurrent requests:                40.00     
Total token throughput (tok/s):          1112.70   
---------------Time to First Token----------------
Mean TTFT (ms):                          16712.38  
Median TTFT (ms):                        16553.61  
P99 TTFT (ms):                           39217.39  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.44     
Median TPOT (ms):                        25.64     
P99 TPOT (ms):                           46.10     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.38     
Median ITL (ms):                         21.38     
P99 ITL (ms):                            247.55    
==================================================